# DuctType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Duct..::..DuctType Property
Duct Class See Also
---
The duct type of this duct.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DuctType DuctType { get; set; }
```

Visual Basic
---
```text
Public Property DuctType As DuctType
	Get
	Set
```

Visual C++
---
```text
public:
property DuctType^ DuctType {
	DuctType^ get ();
	void set (DuctType^ value);
}
```

# See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace